<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // 生成应用公共文件


    // 定义demo模块的自动生成 （按照实际定义的文件名生成）
    'admin'     => [ //模块
        '__file__'   => [],
        '__dir__'   => [],
        'controller'   => [],
        'model'   => [],
        'view'   => ['common/common_list'],
    ],
    // 其他更多的模块定义
];
